[TC_WOTC_MILL_JACKHAMMER_T1 X2WeaponTemplate]
FriendlyName="<font color='#ECECEC'><b>Pancor Jackhammer</b></font>"
FriendlyNamePlural="<font color='#ECECEC'><b>Jackhammer</b></font>"
AbilityDescName="автоматический дробовик"
BriefSummary=Jackhammer (\"Отбойник\") -  автоматический дробовик производства американской компании Pancor Corporation. Оружие представляет собой самозарядное револьверное ружьё, выполненный по схеме «булл-пап» под патрон 12-го калибра. Всего было выпущено лишь несколько прототипов, которые испытывались в 1990-х годах однако так и не вызвали сколько-нибудь существенного интереса у потенциальных покупателей - военных и полиции, поэтому на вооружение «Jackhammer» принят так и не был. К настоящему времени статус проекта Jackhammer - «разработка завершена», однако о производстве этого оружия речь не идёт и видимо так никогда и не пойдёт - Jackhammer навсегда останется лишь в виде считанных прототипов (что неудивительно, учитывая некоторые конструктивные особенности и просчеты).\nИмея на руках чертежи данного образца, мы сможем произвести данный образец, хотя и в ограниченном количестве. Кроме того проведя некоторые исследования и улучшения, мы сможем исправить часть конструктивных недостатков присущих оригинальной разработке."
TacticalText="<Bullet/>Тип: Автоматический дробовик системы булл-пап\n<Bullet/>Режим ведения огня: Автоматический\n<Bullet/>Принцип действия: Отвод пороховых газов, Подвижный вперед ствол\n<Bullet/>Тип боеприпаса: 12 калибр\n<Bullet/>Страна производитель: США\n<Bullet/>Уровень технологии: Базовое оружие"

[TC_WOTC_MILL_JACKHAMMER_T2 X2WeaponTemplate]
FriendlyName="<font color='#27AAE1'><b>XM32E1 Sledgehammer</b></font>"
FriendlyNamePlural="<font color='#27AAE1'><b>XM32E1</b></font>"
AbilityDescName="автоматический дробовик"
BriefSummary=Jackhammer (Отбойник) -  автоматический дробовик производства американской компании Pancor Corporation. Оружие представляет собой самозарядное револьверное ружьё, выполненный по схеме «булл-пап» под патрон 12-го калибра. Всего было выпущено лишь несколько прототипов, которые испытывались в 1990-х годах однако так и не вызвали сколько-нибудь существенного интереса у потенциальных покупателей - военных и полиции, поэтому на вооружение «Jackhammer» принят так и не был. К настоящему времени статус проекта Jackhammer - «разработка завершена», однако о производстве этого оружия речь не идёт и видимо так никогда и не пойдёт - Jackhammer навсегда останется лишь в виде считанных прототипов (что неудивительно, учитывая некоторые конструктивные особенности и просчеты).\nXM32E1 (кодовое имя - \"Кувалда\") - наш первый опыт модернизации Jackhammer. Замена большинства деталей на изготовленные из инопланетных сплавов, повысила эксплуатационные характеристики данного образца. А использование модернизированного наполнения патронов, на основе инопланетных сплавов и Элерия, значительно повысила его боевые характеристики."
TacticalText="<Bullet/>Тип: Автоматический дробовик системы булл-пап\n<Bullet/>Режим ведения огня: Автоматический\n<Bullet/>Принцип действия: Отвод пороховых газов, Подвижный вперед ствол\n<Bullet/>Тип боеприпаса: 12 калибр\n<Bullet/>Страна производитель: США\n<Bullet/>Уровень технологии: Магнитное оружие"

[TC_WOTC_MILL_JACKHAMMER_T3 X2WeaponTemplate]
FriendlyName="<font color='#CF4517'><b>XM32E2 Shockhammer</b></font>"
FriendlyNamePlural="<font color='#CF4517'><b>XM32E2</b></font>"
AbilityDescName="автоматический дробовик"
BriefSummary=Jackhammer (Отбойник) -  автоматический дробовик производства американской компании Pancor Corporation. Оружие представляет собой самозарядное револьверное ружьё, выполненный по схеме «булл-пап» под патрон 12-го калибра. Всего было выпущено лишь несколько прототипов, которые испытывались в 1990-х годах однако так и не вызвали сколько-нибудь существенного интереса у потенциальных покупателей - военных и полиции, поэтому на вооружение «Jackhammer» принят так и не был. К настоящему времени статус проекта Jackhammer - «разработка завершена», однако о производстве этого оружия речь не идёт и видимо так никогда и не пойдёт - Jackhammer навсегда останется лишь в виде считанных прототипов (что неудивительно, учитывая некоторые конструктивные особенности и просчеты).\nXM32E2 (\"Молотобой\") - наш следующий шаг на пути модернизации Jackhammer. Благодаря замене ствола высокочастотным цилиндром нам удалось повысить емкость боезапаса данного образца, что сказалось на возможностях вести длительные перестрелки с противником. Кроме того ствол был изготовлен из инопланетных сплавов, что снизило отдачу и повысило эффективный радиус поражения цели."
TacticalText="<Bullet/>Тип: Автоматический дробовик системы булл-пап\n<Bullet/>Режим ведения огня: Автоматический\n<Bullet/>Принцип действия: Отвод пороховых газов, Подвижный вперед ствол\n<Bullet/>Тип боеприпаса: 12 калибр\n<Bullet/>Страна производитель: США\n<Bullet/>Уровень технологии: Лучевое оружие"